; domain
(define (domain grid-visitAll)
(:requirements :strips :typing :negative-preconditions)
(:types
place - object
)
(:predicates
	(at-robot ?x1 - place)
	(visited ?x1 - place)
	(connected ?x1 - place ?x2 - place)
)
(:action move
	:parameters (?x1 - place ?x2 - place )
	:precondition (and
	(not(at-robot ?x2))
	(at-robot ?x1)
	(connected ?x1 ?x2))
	:effect (and
	(at-robot ?x2)
	(not(at-robot ?x1)))
)
(:action visit
	:parameters (?x1 - place )
	:precondition (and
	(at-robot ?x1)
	(not(visited ?x1)))
	:effect (and
	(visited ?x1))
)
)

; problem
(define (problem grid-4)
(:domain grid-visitAll)
(:objects
	loc-x0-y0
	loc-x0-y1
	loc-x0-y2
	loc-x0-y3
	loc-x1-y0
	loc-x1-y1
	loc-x1-y2
	loc-x1-y3
	loc-x2-y0
	loc-x2-y1
	loc-x2-y2
	loc-x2-y3
	loc-x3-y0
	loc-x3-y1
	loc-x3-y2
	loc-x3-y3
- place

)
(:init
	(at-robot loc-x2-y2)
	(visited loc-x2-y2)
	(connected loc-x0-y0 loc-x1-y0)
 	(connected loc-x0-y0 loc-x0-y1)
 	(connected loc-x0-y1 loc-x1-y1)
 	(connected loc-x0-y1 loc-x0-y0)
 	(connected loc-x0-y1 loc-x0-y2)
 	(connected loc-x0-y2 loc-x1-y2)
 	(connected loc-x0-y2 loc-x0-y1)
 	(connected loc-x0-y2 loc-x0-y3)
 	(connected loc-x0-y3 loc-x1-y3)
 	(connected loc-x0-y3 loc-x0-y2)
 	(connected loc-x1-y0 loc-x0-y0)
 	(connected loc-x1-y0 loc-x2-y0)
 	(connected loc-x1-y0 loc-x1-y1)
 	(connected loc-x1-y1 loc-x0-y1)
 	(connected loc-x1-y1 loc-x2-y1)
 	(connected loc-x1-y1 loc-x1-y0)
 	(connected loc-x1-y1 loc-x1-y2)
 	(connected loc-x1-y2 loc-x0-y2)
 	(connected loc-x1-y2 loc-x2-y2)
 	(connected loc-x1-y2 loc-x1-y1)
 	(connected loc-x1-y2 loc-x1-y3)
 	(connected loc-x1-y3 loc-x0-y3)
 	(connected loc-x1-y3 loc-x2-y3)
 	(connected loc-x1-y3 loc-x1-y2)
 	(connected loc-x2-y0 loc-x1-y0)
 	(connected loc-x2-y0 loc-x3-y0)
 	(connected loc-x2-y0 loc-x2-y1)
 	(connected loc-x2-y1 loc-x1-y1)
 	(connected loc-x2-y1 loc-x3-y1)
 	(connected loc-x2-y1 loc-x2-y0)
 	(connected loc-x2-y1 loc-x2-y2)
 	(connected loc-x2-y2 loc-x1-y2)
 	(connected loc-x2-y2 loc-x3-y2)
 	(connected loc-x2-y2 loc-x2-y1)
 	(connected loc-x2-y2 loc-x2-y3)
 	(connected loc-x2-y3 loc-x1-y3)
 	(connected loc-x2-y3 loc-x3-y3)
 	(connected loc-x2-y3 loc-x2-y2)
 	(connected loc-x3-y0 loc-x2-y0)
 	(connected loc-x3-y0 loc-x3-y1)
 	(connected loc-x3-y1 loc-x2-y1)
 	(connected loc-x3-y1 loc-x3-y0)
 	(connected loc-x3-y1 loc-x3-y2)
 	(connected loc-x3-y2 loc-x2-y2)
 	(connected loc-x3-y2 loc-x3-y1)
 	(connected loc-x3-y2 loc-x3-y3)
 	(connected loc-x3-y3 loc-x2-y3)
 	(connected loc-x3-y3 loc-x3-y2)

)
(:goal
(and
	(visited loc-x0-y0)
	(visited loc-x0-y1)
	(visited loc-x0-y3)
	(visited loc-x1-y0)
	(visited loc-x2-y2)
	(visited loc-x3-y0)
	(visited loc-x3-y2)
	(visited loc-x3-y3)
)
)
)

; plan
1. (move loc-x2-y2 loc-x3-y2)
   deleted: (at-robot loc-x2-y2)
   added: (at-robot loc-x3-y2)
   goals met: 1 of 8
2. (visit loc-x3-y2)
   added: (visited loc-x3-y2)
   goals met: 2 of 8
3. (move loc-x3-y2 loc-x2-y2)
   deleted: (at-robot loc-x3-y2)
   added: (at-robot loc-x2-y2)
   goals met: 2 of 8
4. (move loc-x2-y2 loc-x1-y2)
   deleted: (at-robot loc-x2-y2)
   added: (at-robot loc-x1-y2)
   goals met: 2 of 8
5. (move loc-x1-y2 loc-x1-y1)
   deleted: (at-robot loc-x1-y2)
   added: (at-robot loc-x1-y1)
   goals met: 2 of 8
6. (move loc-x1-y1 loc-x0-y1)
   deleted: (at-robot loc-x1-y1)
   added: (at-robot loc-x0-y1)
   goals met: 2 of 8
7. (move loc-x0-y1 loc-x0-y0)
   deleted: (at-robot loc-x0-y1)
   added: (at-robot loc-x0-y0)
   goals met: 2 of 8
8. (visit loc-x0-y0)
   added: (visited loc-x0-y0)
   goals met: 3 of 8
9. (move loc-x0-y0 loc-x0-y1)
   deleted: (at-robot loc-x0-y0)
   added: (at-robot loc-x0-y1)
   goals met: 3 of 8
10. (visit loc-x0-y1)
   added: (visited loc-x0-y1)
   goals met: 4 of 8
11. (move loc-x0-y1 loc-x1-y1)
   deleted: (at-robot loc-x0-y1)
   added: (at-robot loc-x1-y1)
   goals met: 4 of 8
12. (move loc-x1-y1 loc-x1-y0)
   deleted: (at-robot loc-x1-y1)
   added: (at-robot loc-x1-y0)
   goals met: 4 of 8
13. (visit loc-x1-y0)
   added: (visited loc-x1-y0)
   goals met: 5 of 8
14. (move loc-x1-y0 loc-x1-y1)
   deleted: (at-robot loc-x1-y0)
   added: (at-robot loc-x1-y1)
   goals met: 5 of 8
15. (move loc-x1-y1 loc-x1-y2)
   deleted: (at-robot loc-x1-y1)
   added: (at-robot loc-x1-y2)
   goals met: 5 of 8
16. (move loc-x1-y2 loc-x1-y3)
   deleted: (at-robot loc-x1-y2)
   added: (at-robot loc-x1-y3)
   goals met: 5 of 8
17. (move loc-x1-y3 loc-x0-y3)
   deleted: (at-robot loc-x1-y3)
   added: (at-robot loc-x0-y3)
   goals met: 5 of 8
18. (visit loc-x0-y3)
   added: (visited loc-x0-y3)
   goals met: 6 of 8
19. (move loc-x0-y3 loc-x1-y3)
   deleted: (at-robot loc-x0-y3)
   added: (at-robot loc-x1-y3)
   goals met: 6 of 8
20. (move loc-x1-y3 loc-x1-y2)
   deleted: (at-robot loc-x1-y3)
   added: (at-robot loc-x1-y2)
   goals met: 6 of 8
21. (move loc-x1-y2 loc-x2-y2)
   deleted: (at-robot loc-x1-y2)
   added: (at-robot loc-x2-y2)
   goals met: 6 of 8
22. (move loc-x2-y2 loc-x3-y2)
   deleted: (at-robot loc-x2-y2)
   added: (at-robot loc-x3-y2)
   goals met: 6 of 8
23. (move loc-x3-y2 loc-x3-y3)
   deleted: (at-robot loc-x3-y2)
   added: (at-robot loc-x3-y3)
   goals met: 6 of 8
24. (visit loc-x3-y3)
   added: (visited loc-x3-y3)
   goals met: 7 of 8
25. (move loc-x3-y3 loc-x3-y2)
   deleted: (at-robot loc-x3-y3)
   added: (at-robot loc-x3-y2)
   goals met: 7 of 8
26. (move loc-x3-y2 loc-x3-y1)
   deleted: (at-robot loc-x3-y2)
   added: (at-robot loc-x3-y1)
   goals met: 7 of 8
27. (move loc-x3-y1 loc-x3-y0)
   deleted: (at-robot loc-x3-y1)
   added: (at-robot loc-x3-y0)
   goals met: 7 of 8
28. (visit loc-x3-y0)
   added: (visited loc-x3-y0)
   goals met: 8 of 8
